In [1]:
import sqlite3
import pandas as pd

In [2]:
con = sqlite3.connect(':memory:')

https://www.cs.toronto.edu/~delve/data/boston/bostonDetail.html

In [3]:
data = pd.read_csv('boston.csv')
data.head()

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2

In [4]:
data.to_sql('boston', con, index=False, if_exists='replace')

506

In [5]:
pd.read_sql(
    '''
    SELECT * FROM boston
    
    ''',
    con,
)

,CRIM,ZN,INDUS,CHAS,NOX,RM,AGE,DIS,RAD,TAX,PTRATIO,B,LSTAT,MEDV
0,0.00632,18.0,2.31,0.0,0.538,6.575,65.2,4.0900,1.0,296.0,15.3,396.90,4.98,24.0
1,0.02731,0.0,7.07,0.0,0.469,6.421,78.9,4.9671,2.0,242.0,17.8,396.90,9.14,21.6
2,0.02729,0.0,7.07,0.0,0.469,7.185,61.1,4.9671,2.0,242.0,17.8,392.83,4.03,34.7
3,0.03237,0.0,2.18,0.0,0.458,6.998,45.8,6.0622,3.0,222.0,18.7,394.63,2.94,33.4
4,0.06905,0.0,2.18,0.0,0.458,7.147,54.2,6.0622,3.0,222.0,18.7,396.90,5.33,36.2
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
501,0.06263,0.0,11.93,0.0,0.573,6.593,69.1,2.4786,1.0,273.0,21.0,391.99,9.67,22.4
502,0.04527,0.0,11.93,0.0,0.573,6.120,76.7,2.2875,1.0,273.0,21.0,396.90,9.08,20.6
503,0.06076,0.0,11.93,0.0,0.573,6.976,91.0,2.1675,1.0,273.0,21.0,396.90,5.64,23.9
504,0.10959,0.0,11.93,0.0,0.573,6.794,89.3,2.3889,1.0,273.0,21.0,393.45,6.48,22.0
505,0.04741,0.0,11.93,0.0,0.573,6.030,80.8,2.5050,1.0,273.0,21.0,396.90,7.88,11.9

In [ ]:
'''CRIM - —É—Ä–æ–≤–µ–Ω—å –ø—Ä–µ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –Ω–∞ –¥—É—à—É –Ω–∞—Å–µ–ª–µ–Ω–∏—è
ZN - –¥–æ–ª—è –∑–µ–º–µ–ª—å –ø–æ–¥ –∂–∏–ª—É—é –∑–∞—Å—Ç—Ä–æ–π–∫—É –∑–æ–Ω–∏—Ä–æ–≤–∞–Ω–∞ –ø–æ–¥ —É—á–∞—Å—Ç–∫–∏ –ø–ª–æ—â–∞–¥—å—é –±–æ–ª–µ–µ 25 000 –∫–≤. —Ñ—É—Ç–æ–≤.
INDUS - –¥–æ–ª—è –∞–∫—Ä–æ–≤ –Ω–µ—Ç–æ—Ä–≥–æ–≤–æ–≥–æ –±–∏–∑–Ω–µ—Å–∞ –Ω–∞ –≥–æ—Ä–æ–¥.
CHAS - 1, –µ—Å–ª–∏ –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π, 0 –∏–Ω–∞—á–µ
NOX - –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞ (—á–∞—Å—Ç–µ–π –Ω–∞ 10 –º–∏–ª–ª–∏–æ–Ω–æ–≤)
RM - —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –∫–≤–∞—Ä—Ç–∏—Ä–µ
AGE - –¥–æ–ª—è –∂–∏–ª—ã—Ö –¥–æ–º–æ–≤, –ø–æ—Å—Ç—Ä–æ–µ–Ω–Ω—ã—Ö –¥–æ 1940 –≥.
DIS - –≤–∑–≤–µ—à–µ–Ω–Ω—ã–µ —Ä–∞—Å—Å—Ç–æ—è–Ω–∏—è –¥–æ –ø—è—Ç–∏ —Ü–µ–Ω—Ç—Ä–æ–≤ –∑–∞–Ω—è—Ç–æ—Å—Ç–∏ –ë–æ—Å—Ç–æ–Ω–∞
RAD - –∏–Ω–¥–µ–∫—Å –¥–æ—Å—Ç—É–ø–Ω–æ—Å—Ç–∏ –∫ —Ä–∞–¥–∏–∞–ª—å–Ω—ã–º –º–∞–≥–∏—Å—Ç—Ä–∞–ª—è–º
TAX - –ø–æ–ª–Ω–∞—è —Å—Ç–∞–≤–∫–∞ –Ω–∞–ª–æ–≥–∞ –Ω–∞ –∏–º—É—â–µ—Å—Ç–≤–æ –∑–∞ 10 000 –¥–æ–ª–ª–∞—Ä–æ–≤ –°–®–ê
PTRATIO - —Å–æ–æ—Ç–Ω–æ—à–µ–Ω–∏–µ —É—á–µ–Ω–∏–∫–æ–≤ –∏ —É—á–∏—Ç–µ–ª–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
B - 1000(Bk - 0.63)^2, –≥–¥–µ Bk –¥–æ–ª—è —á–µ—Ä–Ω–æ–∫–æ–∂–∏—Ö –ª—é–¥–µ–π –ø–æ –≥–æ—Ä–æ–¥–∞–º
LSTAT - % –±–æ–ª–µ–µ –Ω–∏–∑–∫–æ–≥–æ —Å—Ç–∞—Ç—É—Å–∞ –Ω–∞—Å–µ–ª–µ–Ω–∏—è
MEDV - –°—Ä–µ–¥–Ω—è—è —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≤ 1000 –¥–æ–ª–ª–∞—Ä–æ–≤.
'''

In [192]:
tasks = 0

### –í—Å–µ –∑–∞–¥–∞–Ω–∏—è –Ω—É–∂–Ω–æ –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ç–æ–ª—å–∫–æ —Å –ø–æ–º–æ—â—å—é sql

1. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ –ø—É—Å—Ç—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [193]:
tasks+=1
pd.read_sql(
    '''
    SELECT SUM(CRIM IS NULL) AS CRIM_NULL_ITOG,
           SUM(ZN IS NULL) AS ZN_NULL_ITOG,
           SUM(INDUS IS NULL) AS INDUS_NULL_ITOG,
           SUM(CHAS IS NULL) AS CHAS_NULL_ITOG,
           SUM(NOX IS NULL) AS NOX_NULL_ITOG
    FROM boston
    ''',
    con,
)

,CRIM_NULL_ITOG,ZN_NULL_ITOG,INDUS_NULL_ITOG,CHAS_NULL_ITOG,NOX_NULL_ITOG
0,0,0,0,0,0

2. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π –ø–æ –∫–æ–ª–æ–Ω–æ–∫–∞–º CRIM, ZN, INDUS, CHAS, NOX (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏, –∫–æ–ª-–≤–æ —É–Ω–∏–∫–∞–ª—å–Ω—ã—Ö –∑–Ω–∞—á–µ–Ω–∏–π)

In [194]:
tasks+=1
pd.read_sql(
    '''
    SELECT  COUNT(DISTINCT CRIM) as CRIM_unique_val,
            COUNT(DISTINCT ZN) as ZN_unique_val,
            COUNT(DISTINCT INDUS) as INDUS_unique_val,
            COUNT(DISTINCT CHAS) as CHAS_unique_val,
            COUNT(DISTINCT NOX) as NOX_unique_val
    FROM boston
    ''',
    con,
)

,CRIM_unique_val,ZN_unique_val,INDUS_unique_val,CHAS_unique_val,NOX_unique_val
0,504,26,76,2,81

3. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö –º–µ–¥–∏–∞–Ω–∞ —Ä–∞–≤–Ω–∞ –º–∏–Ω–∏–º–∞–ª—å–Ω–æ–º—É –∑–Ω–∞—á–µ–Ω–∏—é (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX.
–ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ –¥–∞–Ω–Ω—ã–º –≤ —ç—Ç–∏—Ö –∫–æ–ª–æ–Ω–∫–∞—Ö

In [195]:
tasks+=1
pd.read_sql(
    '''
WITH new_table AS(
    SELECT * FROM (
        (SELECT 'CRIM' AS RES, AVG(CRIM) AS MED FROM (SELECT CRIM FROM boston ORDER BY CRIM LIMIT 2 OFFSET (SELECT (COUNT(*) - 1) / 2 FROM boston))),
        (SELECT MIN(CRIM) AS MIN FROM boston))
    UNION
    SELECT * FROM (
        (SELECT 'ZN', AVG(ZN) AS MED FROM (SELECT ZN FROM boston ORDER BY ZN LIMIT 2 OFFSET (SELECT (COUNT(*) - 1) / 2 FROM boston))),
        (SELECT MIN(ZN) AS MIN FROM boston))
    UNION
    SELECT * FROM (
        (SELECT 'INDUS', AVG(INDUS) AS MED FROM (SELECT INDUS FROM boston ORDER BY INDUS LIMIT 2 OFFSET (SELECT (COUNT(*) - 1) / 2 FROM boston))),
        (SELECT MIN(INDUS) AS MIN FROM boston))
    UNION
    SELECT * FROM (
        (SELECT 'CHAS', AVG(CHAS) AS MED FROM (SELECT CHAS FROM boston ORDER BY CHAS LIMIT 2 OFFSET (SELECT (COUNT(*) - 1) / 2 FROM boston))),
        (SELECT MIN(CHAS) AS MIN FROM boston))
    UNION
    SELECT * FROM (
        (SELECT 'NOX', AVG(NOX) AS MED FROM (SELECT NOX FROM boston ORDER BY NOX LIMIT 2 OFFSET (SELECT (COUNT(*) - 1) / 2 FROM boston))),
        (SELECT MIN(NOX) AS MIN FROM boston))
    )
    
    SELECT * FROM new_table
    WHERE MED = MIN
    
    
    ''',
    con,
)

    RES  MED  MIN
0  CHAS  0.0  0.0
1    ZN  0.0  0.0

–ü–æ —Ä–µ–∑—É–ª—å—Ç–∞—Ç–∞–º –≤—ã–±–æ—Ä–∫–∏, –º–æ–∂–Ω–æ –ø—Ä–µ–¥–ø–æ–ª–æ–∂–∏—Ç—å —á—Ç–æ –±–æ–ª—å—à–∞—è —á–∞—Å—Ç—å –∑–Ω–∞—á–µ–Ω–∏–π –≤ —Å—Ç–æ–ª–±—Ü–∞—Ö CHAS –∏ ZN –∏–º–µ—é—Ç –º–∏–Ω–∏–º–∞–ª—å–Ω–æ–µ –∑–Ω–∞—á–µ–Ω–∏–µ(0)

4. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–∑–Ω–∏—Ü—É –º–µ–∂–¥—É —Å—Ä–µ–¥–Ω–µ–º –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ–º –∫–æ–º–Ω–∞—Ç(RM) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é(MEDV) –∏ 25 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. 
–ê–Ω–∞–ª–æ–≥–∏—á–Ω–æ –ø–æ 50, 100, 200, 300 —Å–∞–º—ã–º–∏ –¥–µ—à–µ–≤—ã–º–∏ –¥–æ–º–∞–º–∏. (–∫–æ–ª-–≤–æ –¥–æ–º–æ–≤(25,50,100,200,300), —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –Ω–∏—Ö, —Å—Ä–µ–¥–Ω–µ–µ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ —Å–∞–º—ã—Ö –¥–æ—Ä–æ–≥–∏—Ö, —Ä–∞–∑–Ω–∏—Ü–∞).
–ù–∞–ø–∏—à–∏—Ç–µ –≤–ª–∏—è–µ—Ç –ª–∏ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –Ω–∞ —Å—Ç–æ–∏–º–æ—Å—Ç—å –∏ –∫–∞–∫ —Å–∏–ª—å–Ω–æ.

In [196]:
tasks+=1
pd.read_sql(
    '''
SELECT (SELECT "25") as quantity_house,
       (SELECT avg(RM) FROM boston where MEDV = (SELECT max(MEDV)from boston)) AS rich,
       (SELECT avg(RM) FROM (SELECT*from boston order by MEDV  limit 25)) AS needy,
       (SELECT avg(RM) FROM boston where MEDV = (SELECT max(MEDV)from boston))-(SELECT avg(RM) FROM (SELECT*from boston order by MEDV  limit 25)) as margin
UNION ALL
SELECT (SELECT "50") as quantity_house,
       (SELECT avg(RM) FROM boston where MEDV = (SELECT max(MEDV)from boston)) AS rich,
       (SELECT avg(RM) FROM (SELECT*from boston order by MEDV  limit 50)) AS needy,
       (SELECT avg(RM) FROM boston where MEDV = (SELECT max(MEDV)from boston))-(SELECT avg(RM) FROM (SELECT*from boston order by MEDV  limit 50)) as margin
UNION ALL       
SELECT (SELECT "100") as quantity_house,
       (SELECT avg(RM) FROM boston where MEDV = (SELECT max(MEDV)from boston)) AS rich,
       (SELECT avg(RM) FROM (SELECT*from boston order by MEDV  limit 100)) AS needy,
       (SELECT avg(RM) FROM boston where MEDV = (SELECT max(MEDV)from boston))-(SELECT avg(RM) FROM (SELECT*from boston order by MEDV  limit 100)) as margin
UNION ALL       
SELECT (SELECT "200") as quantity_house,
       (SELECT avg(RM) FROM boston where MEDV = (SELECT max(MEDV)from boston)) AS rich,
       (SELECT avg(RM) FROM (SELECT*from boston order by MEDV  limit 200)) AS needy,
       (SELECT avg(RM) FROM boston where MEDV = (SELECT max(MEDV)from boston))-(SELECT avg(RM) FROM (SELECT*from boston order by MEDV  limit 200)) as margin
UNION ALL       
SELECT (SELECT "300") as quantity_house,
       (SELECT avg(RM) FROM boston where MEDV = (SELECT max(MEDV)from boston)) AS rich,
       (SELECT avg(RM) FROM (SELECT*from boston order by MEDV  limit 300)) AS needy,
       (SELECT avg(RM) FROM boston where MEDV = (SELECT max(MEDV)from boston))-(SELECT avg(RM) FROM (SELECT*from boston order by MEDV  limit 300)) as margin

''',
    con,
)

  quantity_house   rich     needy    margin
0             25  7.484  5.747840  1.736160
1             50  7.484  5.753240  1.730760
2            100  7.484  5.887120  1.596880
3            200  7.484  5.911705  1.572295
4            300  7.484  5.972227  1.511773

–ü–æ —Ä–µ–∑—É–ª—å—Ç–∞—Ç–∞–º –≤—ã–±–æ—Ä–∫–∏, –º–æ–∂–Ω–æ –ø—Ä–µ–¥–ø–æ–ª–æ–∂–∏—Ç—å —á—Ç–æ –∫–æ–ª-–≤–æ –∫–æ–º–Ω–∞—Ç –≤ –¥–æ–º–µ –≤–ª–∏—è–µ—Ç –Ω–∞ —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–∞ –≤ —Ü–µ–ª–æ–º.–£ –±–æ–≥–∞—Ç—ã—Ö –∫–æ–º–Ω–∞—Ç –±–æ–ª—å—à–µ, —á–µ–º —É –Ω–∞—Å–µ–ª–µ–Ω–∏—è —Å –±–æ–ª–µ–µ –Ω–∏–∑–∫–∏–º —Å—Ç–∞—Ç—É—Å–æ–º(–±–µ–¥–Ω—ã—Ö).

5. –í—ã–≤–µ–¥–∏—Ç–µ —Ä–∞–Ω–≥–∏ –∑–Ω–∞—á–µ–Ω–∏–π –∫–æ–ª–æ–Ω–∫–∏ LSTAT(–ø—Ä–æ—Ü–µ–Ω—Ç –Ω–∞—Å–µ–ª–µ–Ω–∏—è —Å –±–æ–ª–µ–µ –Ω–∏–∑–∫–∏–º —Å—Ç–∞—Ç—É—Å–æ–º) –≤ –¥–æ–º–∞—Ö —Å —Å–∞–º–æ–π –¥–æ—Ä–æ–≥–æ–π —Å—Ç–æ–∏–º–æ—Å—Ç—å—é (–∑–Ω–∞—á–µ–Ω–∏–µ LSTAT, —Å—Ç–æ–∏–º–æ—Å—Ç—å, —Ä–∞–Ω–≥) —Å—Ä–µ–¥–∏ –≤—Å–µ—Ö –∑–Ω–∞—á–µ–Ω–∏–π LSTAT. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [197]:
tasks+=1
pd.read_sql(
    '''
    SELECT * FROM
    (SELECT LSTAT, MEDV,  rank() OVER (ORDER BY LSTAT) AS RANG FROM boston)
    WHERE MEDV = (SELECT MAX(MEDV) FROM boston)
    ''',
    con,
)

    LSTAT  MEDV  RANG
0    1.73  50.0     1
1    1.92  50.0     2
2    2.88  50.0     6
3    2.96  50.0     8
4    2.97  50.0     9
5    3.16  50.0    15
6    3.26  50.0    17
7    3.32  50.0    18
8    3.70  50.0    26
9    3.73  50.0    27
10   4.45  50.0    41
11   4.63  50.0    50
12   5.12  50.0    67
13   7.44  50.0   141
14   8.88  50.0   181
15   9.53  50.0   203

–ü–æ —Ä–µ–∑—É–ª—å—Ç–∞—Ç–∞–º –≤—ã–±–æ—Ä–∫–∏, –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –≤—ã–≤–æ–¥, —á—Ç–æ –±–æ–ª–µ–µ –≤—ã—Å–æ–∫–∏–π —Å—Ç–∞—Ç—É—Å, –∏–º–µ—é—Ç –≤–ª–∞–¥–µ–ª—å—Ü—ã –¥–æ—Ä–æ–≥–æ–π –Ω–µ–¥–≤–∏–∂–∏–º–æ—Å—Ç–∏.

6. –í—ã–≤–µ–¥–∏—Ç–µ —Å—Ä–µ–¥–Ω—é—é —Å—Ç–æ–∏–º–æ—Å—Ç—å –¥–æ–º–æ–≤ –≥—Ä–∞–Ω–∏—á–∞—â–∏—Ö —Å —Ä–µ–∫–æ–π(CHAS) –∏ –Ω–µ—Ç (–≥—Ä–∞–Ω–∏—á–∏—Ç/–Ω–µ –≥—Ä–∞–Ω–∏—á–∏—Ç, —Å—Ç–æ–∏–º–æ—Å—Ç—å)

In [198]:
tasks+=1
pd.read_sql(
    '''
    SELECT ROUND(AVG(MEDV),2) as PRICE_HOUSE, CHAS
    FROM boston
    GROUP BY CHAS 
    ''',
    con,
)

   PRICE_HOUSE  CHAS
0        22.09   0.0
1        28.44   1.0

7. –í—ã–≤–µ–¥–∏—Ç–µ –≤—Å–µ –∫–æ–ª–æ–Ω–∫–∏, —É –∫–æ—Ç–æ—Ä—ã—Ö —Å—Ä–µ–¥–Ω–µ–µ –∑–Ω–∞—á–µ–Ω–∏–µ –≤—ã—à–µ, –∫–æ–≥–¥–∞ –¥–æ–º –≥—Ä–∞–Ω–∏—á–∏—Ç —Å —Ä–µ–∫–æ–π (–Ω–∞–∑–≤–∞–Ω–∏–µ –∫–æ–ª–æ–Ω–∫–∏) –≤—ã–±–∏—Ä–∞—è –∏–∑ CRIM, ZN, INDUS, CHAS, NOX. –ù–∞–ø–∏—à–∏—Ç–µ –∫–∞–∫–æ–π –≤—ã–≤–æ–¥ –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –ø–æ —ç—Ç–∏–º –¥–∞–Ω–Ω—ã–º.

In [199]:
tasks+=1
pd.read_sql(
    '''
    SELECT AVG(CRIM), AVG(ZN), AVG(INDUS), AVG(CHAS), AVG(NOX) FROM boston
    ''',
    con,
)

   AVG(CRIM)    AVG(ZN)  AVG(INDUS)  AVG(CHAS)  AVG(NOX)
0   3.593761  11.363636   11.136779    0.06917  0.554695

In [145]:
tasks+=1
pd.read_sql(
    '''
    SELECT AVG(CRIM), AVG(ZN), AVG(INDUS), AVG(CHAS), AVG(NOX) FROM boston
    WHERE CHAS = 1
    ''',
    con,
)

   AVG(CRIM)   AVG(ZN)  AVG(INDUS)  AVG(CHAS)  AVG(NOX)
0    1.85167  7.714286   12.719143        1.0  0.593426

In [144]:
tasks+=1
pd.read_sql(
    '''
with table_1 AS(SELECT * FROM 
    (SELECT 'CRIM' AS ITOG, ((SELECT AVG(CRIM) FROM boston WHERE CHAS = 1) > AVG(CRIM)) AS RES
    FROM boston
    UNION ALL
    SELECT 'ZN' AS ITOG, ((SELECT AVG(ZN) FROM boston WHERE CHAS = 1) > AVG(ZN)) AS RES
    FROM boston
    UNION ALL
    SELECT 'INDUS' AS ITOG, ((SELECT AVG(INDUS) FROM boston WHERE CHAS = 1) > AVG(INDUS)) AS RES
    FROM boston
    UNION ALL
    SELECT 'CHAS' AS ITOG, ((SELECT AVG(CHAS) FROM boston WHERE CHAS = 1) > AVG(CHAS)) AS RES
    FROM boston
    UNION ALL
    SELECT 'NOX' AS ITOG, ((SELECT AVG(NOX) FROM boston WHERE CHAS = 1) > AVG(NOX)) AS RES
    FROM boston
    ))
    SELECT * FROM table_1
    WHERE RES = 1
    ''',
    con,
)

    ITOG  RES
0  INDUS    1
1   CHAS    1
2    NOX    1

–ü–æ —Ä–µ–∑—É–ª—å—Ç–∞—Ç–∞–º –≤—ã–±–æ—Ä–∫–∏, –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –≤—ã–≤–æ–¥, —á—Ç–æ –≤ –æ—Å–Ω–æ–≤–Ω–æ–º –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω—ã–µ –ø—Ä–µ–¥–ø—Ä–∏—è—Ç–∏—è —Å—Ç—Ä–æ—è—Ç—Å—è —É —Ä–µ–∫–∏ –∏ —Å–æ–æ—Ç–≤–µ—Ç—Å–≤–µ–Ω–Ω–æ –ø–æ–≤—ã—à–µ–Ω–∞ –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞.

8. –í—ã–≤–µ–¥–∏—Ç–µ –∑–Ω–∞—á–µ–Ω–∏—è –¥–æ–ª–µ–π –ø—Ä–æ–º—ã—à–ª–µ–Ω–Ω–æ–π –∑–∞—Å—Ç—Ä–æ–π–∫–∏(INDUS), –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏–∏ –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞(NOX) –∏ –ø–æ –∏—Ö –ø–µ—Ä—Ü–µ–Ω—Ç–∏–ª—è–º - 10, 20 ... 100 ( –ø–µ—Ä—Ü–µ—Ç–∏–ª—å(10,20...100),–∑–Ω–∞—á–µ–Ω–∏–µ INDUS, –∑–Ω–∞—á–µ–Ω–∏–µ NOX). –ù–∞–ø–∏—à–∏—Ç–µ –ø—Ä–æ—Å–ª–µ–∂–∏–≤–∞–µ—Ç—Å—è –º–µ–∂–¥—É –Ω–∏–º–∏ –≤–∑–∞–∏–º–æ—Å–≤—è–∑—å

In [200]:
tasks+=1
pd.read_sql(
    '''
with select_1 AS (
        SELECT perc, MAX(INDUS) AS INDUS FROM (
            SELECT INDUS, (ntile(10) OVER (ORDER BY INDUS)) AS perc FROM boston
        ) GROUP BY perc
    ),
    select_2 AS(
        SELECT perc, MAX(NOX) AS NOX FROM (
            SELECT NOX, (ntile(10) OVER (ORDER BY NOX)) AS perc FROM boston
        ) GROUP BY perc
    )

SELECT select_2.perc * 10 AS PERC, INDUS, NOX FROM select_2 JOIN select_1 ON select_2.perc = select_1.perc


    ''',
    con,
)

   PERC  INDUS    NOX
0    10   2.89  0.426
1    20   4.39  0.442
2    30   5.96  0.472
3    40   7.38  0.507
4    50   9.69  0.538
5    60  13.89  0.580
6    70  18.10  0.609
7    80  18.10  0.671
8    90  19.58  0.713
9   100  27.74  0.871

–ü–æ —Ä–µ–∑—É–ª—å—Ç–∞—Ç–∞–º –≤—ã–±–æ—Ä–∫–∏, –º–æ–∂–Ω–æ —Å–¥–µ–ª–∞—Ç—å –≤—ã–≤–æ–¥, —á—Ç–æ —á–µ–º –±–æ–ª—å—à–µ —Å—Ç—Ä–æ–∏—Ç—Å—è –∏–Ω–¥—É—Å—Ç—Ä–∏–∞–ª—å–Ω–æ–π –∑–∞—Å—Ç—Ä–æ–π–∫–∏, —Ç–µ–º –≤—ã—à–µ –∫–æ–Ω—Ü–µ–Ω—Ç—Ä–∞—Ü–∏—è –æ–∫—Å–∏–¥–æ–≤ –∞–∑–æ—Ç–∞

In [201]:
if tasks==8:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')

–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ